'''Определите, сколько различных слов содержится в тексте'''

print(len(set(input().split())))