'''Напишите программу, которая будет обрабатывать кортежи студентов и выводить
множество уникальных курсов отсортированных по алфавиту,
а также две возрастные группы младше 21 года и включая 21 год и старше
тоже отсортированные по алфавиту.'''

students = [
    ("Анна", 19, ["Математика", "Информатика"]),
    ("Иван", 22, ["Физика", "Информатика"]),
    ("Мария", 19, ["Литература", "Искусство"]),
    ("Алексей", 20, ["Химия", "Биология"]),
    ("Елена", 21, ["Физика", "Искусство"]),
    ("Дмитрий", 18, ["Математика", "Литература"]),
    ("Ольга", 22, ["Информатика", "Биология"]),
    ("Павел", 20, ["Искусство", "Физика"]),
    ("Алина", 19, ["Информатика", "Математика"]),
    ("Артем", 21, ["Биология", "Химия"]),
    ("Наталья", 18, ["Литература", "Искусство"]),
    ("Сергей", 23, ["Информатика", "Физика"]),
    ("Евгения", 20, ["Химия", "Биология"]),
    ("Андрей", 24, ["Искусство", "Литература"]),
    ("Виктория", 22, ["Физика", "Информатика"]),
    ("Максим", 19, ["Биология", "Химия"]),
    ("Юлия", 21, ["Информатика", "Физика"]),
    ("Кирилл", 20, ["Математика", "Биология"]),
    ("Анастасия", 23, ["Литература", "Искусство"]),
    ("Роман", 18, ["Информатика", "Физика"]),
]

print(*sorted(set([science for item in students for science in item[2]])))
print(*sorted([item[0] for item in students if item[1] < 21]))
print(*sorted([item[0] for item in students if item[1] >= 21]))

