'''Напишите лямбда функцию, которая считает значение полинома
в заданной пользователем точке.'''

y = lambda x: x ** 2 + 5 * x + 4

print(y(float(input())))